5_Components/camel-webservice/src/main/resources/data/soap-getCustomerByName.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tra="http://training.gpte.redhat.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <tra:getCustomerByName>
            <name>redhat</name>
        </tra:getCustomerByName>
    </soapenv:Body>
</soapenv:Envelope>